DataProcessors/КалькуляторСметыМедосмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>КалькуляторСметыМедосмотров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМедосмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМедосмотров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Смета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контингент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Численность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаСотрудника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокКонтингента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСсылокВредныхФакторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приказ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриказыМедосмотров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриказСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПереченьВредныхФакторовИРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/КалькуляторСметыМедосмотров/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Формирует печатную форму сметы.
//
// Параметры:
//  Объект				 - ОбработкаОбъект.КалькуляторСметыМедосмотров - объект обработки.
//  ПредполагаемыеУслуги - Массив	 - номенклатура услуг.
//  СуммаСметы			 - Число	 - сумма сметы.
// 
// Возвращаемое значение:
//  ТабличныйДокумент - табличный документ на печать.
//
Функция Печать(Объект, ПредполагаемыеУслуги, СуммаСметы, ВыводитьДействияМедосмотра = Ложь, ПоказыватьУслугиСНулевойЦеной = Истина) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("СметаПоУслугам");
	Область = Макет.ПолучитьОбласть("ОбластьШапка");
	ТабДок.Вывести(Область);
	Область = Макет.ПолучитьОбласть("ОбластьИтог");

	спрВалютаДокумента = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВалютаУчета");
	Если Не ЗначениеЗаполнено(спрВалютаДокумента) Тогда
		спрВалютаДокумента = Справочники.Валюты.Рубль;		
	КонецЕсли;
	Область.Параметры.ИтогоСуммаПоУслугам = ОбщегоНазначения.ФорматСумм(СуммаСметы,,"0") + " " + спрВалютаДокумента;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("ОбластьШапкаТаблицы");
	ТабДок.Вывести(Область);
	
	Для Каждого Шапка Из Объект.Смета Цикл
		Область = Макет.ПолучитьОбласть("ОбластьИтогПоФактору");
		Область.Параметры.Контингент = Шапка.Контингент;
		Область.Параметры.Фактор = СформироватьСтрокуФредныхФакторов(Объект, Шапка.ВредныйФактор);
		Область.Параметры.Количество = Шапка.Численность;
		Область.Параметры.Цена = ПредставлениеСуммы(Шапка.ЦенаЗаСотрудника);
		Область.Параметры.Стоимость = ПредставлениеСуммы(Шапка.Сумма);
		Если Не ТабДок.ПроверитьВывод(Область) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДок.Вывести(Область);
				
		СписокУслуг = НайтиУслугиПоКлиенту(ПредполагаемыеУслуги, Шапка.Клиент); 
		
		Номер = 1;
		Пока СписокУслуг.Следующий() Цикл
			Если (ВыводитьДействияМедосмотра Или ЗначениеЗаполнено(СписокУслуг.Номенклатура))
				И Не (Не ПоказыватьУслугиСНулевойЦеной И СписокУслуг.Цена = 0)	
			Тогда
				Область = Макет.ПолучитьОбласть("ОбластьНоменклатура");
				
				Область.Параметры.Номенклатура = ПредставлениеУслугиСметы(СписокУслуг.Номенклатура, СписокУслуг.ДействиеМедосмотра, ВыводитьДействияМедосмотра);
				Область.Параметры.Количество = Шапка.Численность;
				Область.Параметры.Цена = ПредставлениеСуммы(СписокУслуг.Цена);
				Область.Параметры.Стоимость = ПредставлениеСуммы(СписокУслуг.Цена * Шапка.Численность);
				Область.Параметры.Номер = Номер;
				Номер = Номер + 1;
				Если Не ТабДок.ПроверитьВывод(Область) Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ТабДок.Вывести(Область);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	Возврат ТабДок;
	
КонецФункции

Функция НайтиУслугиПоКлиенту(Услуги, Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Услуги.Номенклатура КАК Номенклатура,
	|	Услуги.Действие КАК ДействиеМедосмотра,
	|	Услуги.Цена КАК Цена,
	|	Услуги.Клиент КАК Клиент
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|/////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Услуги.Номенклатура КАК Номенклатура,
	|   Услуги.ДействиеМедосмотра КАК ДействиеМедосмотра,
	|	Услуги.Цена КАК Цена
	|ИЗ
	|	Услуги КАК Услуги
	|ГДЕ
	|	Услуги.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Услуги", Услуги);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция СформироватьСтрокуФредныхФакторов(Объект, СтрокаВредностей)
	
	МассивФакторов = СтрРазделить(СтрЗаменить(СтрЗаменить(СтрокаВредностей, ";", ","), " ", ""), ",", Ложь);
	
	СтрокаИтог = "";
	Для Каждого Фактор Из МассивФакторов Цикл
		ФакторПредставление = "";
		ПриказСтрока = Лев(Фактор, СтрНайти(Фактор, "_") - 1);
		НомерПП = Прав(Фактор, СтрДлина(Фактор) - СтрНайти(Фактор, "_"));
		СтруктураОтбора = Новый Структура("ПриказСтрока, НомерПП", ПриказСтрока, НомерПП);
		
		СтрокиФакторов = Объект.ТаблицаСсылокВредныхФакторов.НайтиСтроки(СтруктураОтбора);
		Если СтрокиФакторов.Количество() > 0 Тогда
			ВредныйФакторСсылка = СтрокиФакторов[0].ВредныйФактор;
			ВредныйФакторНазвание = СокрЛП(ОбщегоНазначенияБИТКлиентСервер.ЗаполненноеЗначение(ВредныйФакторСсылка.НаименованиеПолное, ВредныйФакторСсылка.Наименование));
			ВредныйФакторНазвание = СтрЗаменить(ВредныйФакторНазвание, Символы.ВК, "");
		КонецЕсли;
		СтрокаИтог = СтрокаИтог + Фактор + " " + ВредныйФакторНазвание + "," + Символы.ПС;
	КонецЦикла;
	
	Возврат Лев(СтрокаИтог, СтрДлина(СтрокаИтог) - 2);
	
КонецФункции

Функция ПредставлениеСуммы(Сумма)
	
	Если Цел(Сумма) = (Сумма) Тогда
		Возврат Строка(Сумма);
	Иначе
		Возврат ОбщегоНазначения.ФорматСумм(Сумма);
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеУслугиСметы(Номенклатура, ДействиеМедосмотра, ВыводитьДействияМедосмотра)
	
	Представление = "";
	
	Если ВыводитьДействияМедосмотра Тогда
		Представление = ОбщегоНазначенияБИТКлиентСервер.ЗаполненноеЗначение(ДействиеМедосмотра.НаименованиеДляПечати, ДействиеМедосмотра.Наименование);
	Иначе
		Представление = ОбщегоНазначенияБИТКлиентСервер.ЗаполненноеЗначение(Номенклатура.НаименованиеПолное, Номенклатура.Наименование);
	КонецЕсли;
	
	Возврат Представление
	
КонецФункции

#КонецОбласти
